
# Используем полный образ Node.js для лучшей совместимости с инструментами разработки.
FROM node:20

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем файлы с зависимостями
COPY package*.json ./

# Устанавливаем ВСЕ зависимости, включая devDependencies, так как они нужны для запуска nodemon
RUN npm ci

# Копируем весь остальной код проекта
COPY . .

# Если в скрипте `build` есть сборка клиента, запускаем её
RUN npm run build

# Открываем порт
EXPOSE 3000

# Запускаем команду "start" из твоего package.json
CMD ["npm", "start"]